/*
  Digispark sketch для эмуляции клавиатуры v1.0
  Версия 0: Чтение кнопок, если любая из них нажата, зажигается светодиод
  Библиотека эмуляции клавиатуры подключена для проверки объёма кода
*/
//-------------------------------------------------------------------
// Подключение библиотек
//-------------------------------------------------------------------
#include <DigiKeyboard.h>

//-------------------------------------------------------------------
// Константы
//-------------------------------------------------------------------
#define LED_PIN 1		//Светодиод
#define BUTTON_START 0	//Кнопка ENTER
#define BUTTON_ESC 2	//Кнопка ESC

#define DELAY 1000


//-------------------------------------------------------------------
// Программа начальной установки
//-------------------------------------------------------------------
void setup() 
{
  pinMode(LED_PIN, OUTPUT);
  pinMode(BUTTON_START, INPUT_PULLUP);
  pinMode(BUTTON_ESC, INPUT_PULLUP);
  
  digitalWrite(LED_PIN, HIGH);   
}

//-------------------------------------------------------------------
// Главный цикл программы
//-------------------------------------------------------------------
void loop() 
{
  bool x = digitalRead(BUTTON_START);  
  bool y = digitalRead(BUTTON_ESC);  
  bool z = !(x & y);
  digitalWrite(LED_PIN, z);   
}
